# SQL Assignment

In [1]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [ ]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [2]:
conn = sqlite3.connect("Db-IMDB-Assignment.db")
c=conn.cursor()

In [3]:
conn.commit()

#### Overview of all tables

In [4]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [5]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

In [8]:
pd.read_sql_query('Select * from Movie ORDER BY 3 limit 5 ',conn)

   index        MID                 title  year  rating  num_votes
0    643  tt0454435                   'D'  2005     6.9       1095
1   2512  tt0156691               'Kaash'  1987     6.5        153
2   2526  tt0118525  ...Aur Pyaar Ho Gaya  1997     4.7        719
3    944  tt0473567             ...Yahaan  2005     7.5        978
4   1185  tt0101244              100 Days  1991     6.5        762

In [9]:
c.execute('UPDATE Movie SET MID=TRIM(MID)')

In [10]:
#Working with the Movies Table
'''
1. Check for spaces
2.Check if the id are in lowercase
3. Check if the data is in standard form and then make changes if needed
'''
sql=c.execute
sql('UPDATE Movie SET MID=TRIM(MID)')
sql('UPDATE Movie SET year=TRIM(year)')

print(pd.read_sql_query('SELECT * FROM Movie where length(MID)>9',conn))
#Hence sure that the data has no extra characters and have been processed

#print(pd.read_sql_query('SELECT count(year) FROM Movie where length(year)>4',conn))

'''____________________________________________________'''

#print(pd.read_sql_query('SELECT (year),SUBSTRING(year,-4,4) as C_year FROM Movie where length(year)>4',conn))
c.execute('UPDATE movie SET year=SUBSTRING(year,-4)')

#print(pd.read_sql_query('SELECT count(year) FROM Movie where length(year)>4',conn))
#No years with size greater than 4

pd.read_sql_query('Select * from movie where title like ".%" ',conn)
c.execute('UPDATE movie SET title=TRIM(title, ".")')
pd.read_sql_query('Select * from movie where title like "\'%" ',conn)
#No values with dots.
c.execute('UPDATE movie SET title=TRIM(title, "\'")')

c.execute('UPDATE movie SET MID= LOWER(MID)')

pd.read_sql_query('Select * from movie where title like "\'%" ',conn)

#Values starting with '

pd.read_sql_query('Select * from movie where title like "%[^a-Z0-9]%" ',conn)

#No title with special character in the beginning or the ending.

#Checking for null values

pd.read_sql_query('Select * from movie where title is null ',conn)
#No values

pd.read_sql_query('Select * from movie where rating is null ',conn)
#No values

pd.read_sql_query('Select * from movie where year is null ',conn)
#No values

pd.read_sql_query('Select * from movie where MID is null ',conn)
#No values

Empty DataFrame
Columns: [index, MID, title, year, rating, num_votes]
Index: []

OperationalError: no such function: SUBSTRING

In [8]:
#Working with the table pERSON

pd.read_sql_query('SELECT * FROM person limit 5',conn)

   index        PID                   Name  Gender
0      0  nm0000288         Christian Bale    Male
1      1  nm0000949         Cate Blanchett  Female
2      2  nm1212722   Benedict Cumberbatch    Male
3      3  nm0365140          Naomie Harris  Female
4      4  nm0785227            Andy Serkis    Male

In [9]:
c.execute('UPDATE movie SET year=SUBSTRING(year,-4)')

In [10]:
c.execute('UPDATE person SET PID=TRIM(PID)')
c.execute('UPDATE person SET Name=TRIM(Name)')
c.execute('UPDATE person SET Gender=TRIM(Gender)')

pd.read_sql_query('SELECT LENGTH(PID) FROM person where PID="nm0000288"',conn)
pd.read_sql_query('SELECT * FROM person where LENGTH(PID)>9',conn)
#THERE ARE A FEW ROWS WITH THE LENGTH(pid) GREATER THAN 9, THAT IS 10.
pd.read_sql_query('SELECT * FROM person where LENGTH(PID)>10',conn)
#There are no rows with length(PID) greater than 10!

#Checking for null values
pd.read_sql_query('SELECT * FROM person where PID is null',conn)
#One value present with index=30439
pd.read_sql_query('SELECT * FROM person where Name is null',conn)
#One value present with index=30439
x=pd.read_sql_query('SELECT COUNT(PID) FROM person where Gender is null',conn)
print(x, 'values have null value for gender')

   COUNT(PID)
0        8224 values have null value for gender

In [11]:
pd.read_sql_query('SELECT * FROM Genre LIMIT 5',conn)
# The Name in genre will always have to be used with the Like command.

   index                                    Name  GID
0      0   Adventure, Drama, Fantasy                0
1      1       Action, Comedy, Crime                1
2      2  Action, Adventure, Fantasy                2
3      3   Action, Adventure, Sci-Fi                3
4      4     Drama, Horror, Thriller                4

In [12]:
#Checking for null values
pd.read_sql_query('SELECT * FROM Genre where Name is null',conn)
# NO null Values

pd.read_sql_query('SELECT * FROM Genre where GID is null',conn)
#No Null Values
c.execute('UPDATE Genre SET Name=TRIM(Name)')

In [13]:
pd.read_sql_query('SELECT * FROM Language LIMIT 5',conn)

   index       Name  LAID
0      0    English     0
1      1    Marathi     1
2      2      Hindi     2
3      3  Cantonese     3
4      4     Telugu     4

In [14]:
pd.read_sql_query('SELECT * FROM Language where Name is null',conn)
#No Null Values
pd.read_sql_query('SELECT * FROM Language where LAID is null',conn)
#No Null Values
c.execute('UPDATE Language SET Name=TRIM(Name)')

In [15]:
pd.read_sql_query('SELECT * FROM Country LIMIT 5',conn)

   index       Name  CID
0      0         UK    0
1      1        USA    1
2      2      India    2
3      3  Australia    3
4      4  Hong Kong    4

In [16]:
c.execute('UPDATE Country SET Name=TRIM(Name)')

In [17]:
pd.read_sql_query('SELECT * FROM location LIMIT 5',conn)
c.execute('UPDATE Location SET Name=TRIM(Name)')

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedy and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [18]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = """WITH CTE_table as
(SELECT new.title , 
     md.PID ,new.year 
FROM M_Director md 
JOIN
(SELECT MID, title,year FROM movie m WHERE MID IN
(SELECT MID FROM M_Genre WHERE GID IN
(SELECT GID FROM GENRE WHERE Name LIKE '%Comedy%')) AND ((((m.year%4)=0 AND (m.year%100)!=0) OR ((m.year%400)=0)))) new
ON md.MID=new.MID)
SELECT cte.title, p.Name, cte.year FROM cte_table cte JOIN person p ON  cte.PID= p.PID ORDER BY 3
""" 
grader_1(query1)

             title            Name  year
0       Jagte Raho      Amit Mitra  1956
1         Funtoosh    Chetan Anand  1956
2          Jagriti     Satyen Bose  1956
3        New Delhi     Mohan Segal  1956
4         Kohinoor      S.U. Sunny  1960
5           Parakh       Bimal Roy  1960
6    Love in Simla     R.K. Nayyar  1960
7         Rajkumar      K. Shankar  1964
8  Kashmir Ki Kali  Shakti Samanta  1964
9           Leader   Ram Mukherjee  1964
Wall time: 144 ms

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [19]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """ *** Write your query for the question 2 *** """
grader_2('''SELECT Name from Person WHERE PID IN 
(SELECT TRIM(PID) FROM M_Cast WHERE MID=
(SELECT MID FROM movie WHERE title="Anand"))''')

               Name
0  Amitabh Bachchan
1     Rajesh Khanna
2     Sumita Sanyal
3        Ramesh Deo
4         Seema Deo
5    Asit Kumar Sen
6        Dev Kishan
7      Atam Prakash
8     Lalita Kumari
9            Savita
Wall time: 72 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [21]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    print(q3_a.shape)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    print(q3_b.shape)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)<1970
)
) r1 
on r1.PD=p.PID 
"""
query_more_1990 =""" 
Select p.PID from Person p 
inner join 
(
    select trim(mc.PID) PD, mc.MID from M_cast mc 
where mc.MID 
in 
(
    select mv.MID from Movie mv where CAST(SUBSTR(mv.year,-4) AS Integer)>1990
)
) r1 
on r1.PD=p.PID """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

(4942, 1)
(62570, 1)
True
Wall time: 648 ms

In [20]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    assert (q3_results.shape == (300,1))

query3 = """ 
SELECT name FROM person WHERE PID IN
(SELECT TRIM(PID) FROM M_Cast WHERE MID IN
(SELECT MID FROM Movie WHERE year<1970)
INTERSECT
SELECT TRIM(PID) FROM M_Cast WHERE MID IN
(SELECT MID FROM Movie WHERE year>1990))

"""
grader_3(query3)

               Name
0      Rishi Kapoor
1  Amitabh Bachchan
2            Asrani
3      Zohra Sehgal
4   Parikshat Sahni
5     Rakesh Sharma
6       Sanjay Dutt
7         Ric Young
8             Yusuf
9    Suhasini Mulay
Wall time: 320 ms

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [22]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    return (query_4a.shape == (1462,2))

query_4a =""" SELECT COUNT(m.MID) Number, md.PID FROM movie m inner join M_Director md ON m.MID=md.MID GROUP BY md.PID  """
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

   Number        PID
0       1  nm0000180
1       1  nm0000187
2       1  nm0000229
3       1  nm0000269
4       1  nm0000386
5       2  nm0000487
6       1  nm0000965
7       1  nm0001060
8       1  nm0001162
9       1  nm0001241
True
Wall time: 40 ms

In [23]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))

query4 = """ SELECT movie_count.number ,p.name FROM person p JOIN
(SELECT COUNT(m.MID) Number, md.PID FROM movie m JOIN M_Director md ON m.MID=md.MID GROUP BY md.PID) AS movie_count
 ON movie_count.PID=p.PID WHERE movie_count.number>=10 ORDER BY movie_count.number DESC """
grader_4(query4)

   Number                  Name
0      39          David Dhawan
1      35          Mahesh Bhatt
2      30       Ram Gopal Varma
3      30          Priyadarshan
4      29          Vikram Bhatt
5      27  Hrishikesh Mukherjee
6      21           Yash Chopra
7      19        Shakti Samanta
8      19       Basu Chatterjee
9      18          Subhash Ghai
Wall time: 56 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [24]:
c.execute('''UPDATE Person SET PID=TRIM(PID)''')

In [25]:
c.execute('''UPDATE M_cast SET PID=TRIM(PID)''')

In [26]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))
''''''
'''SELECT mc.MID,COUNT(MID), p.PID FROM M_Cast mc INNER JOIN Person p ON mc.PID=p.PID WHERE TRIM(p.Gender)!='Female' group by mc.MID'''
#*** Write your query that will get movie id, and number of people for each geneder ***
query_5aa ="""
SELECT DISTINCT MID,gender, COUNT(*) Counts from
                              (SELECT  mv1.MID, ps1.Gender, ps1.PID FROM Movie mv1
                               JOIN M_Cast mc1
                               ON mv1.MID = mc1.MID
                               JOIN Person ps1
                               ON (mc1.PID) = ps1.PID)           
                               GROUP BY MID, gender 
 """
print(grader_5aa(query_5aa))

         MID  Gender  Counts
0  tt0021594    None       1
1  tt0021594  Female       3
2  tt0021594    Male       5
3  tt0026274    None       2
4  tt0026274  Female      11
5  tt0026274    Male       9
6  tt0027256    None       2
7  tt0027256  Female       5
8  tt0027256    Male       8
9  tt0028217  Female       3
True
Wall time: 784 ms

In [27]:
pd.read_sql_query("SELECT COUNT(DISTINCT MID) FROM Movie",conn)

   COUNT(DISTINCT MID)
0                 3473

In [28]:
pd.read_sql_query("SELECT * FROM Person ",conn)

       index        PID                  Name  Gender
0          0  nm0000288        Christian Bale    Male
1          1  nm0000949        Cate Blanchett  Female
2          2  nm1212722  Benedict Cumberbatch    Male
3          3  nm0365140         Naomie Harris  Female
4          4  nm0785227           Andy Serkis    Male
...      ...        ...                   ...     ...
37561  38276  nm2182643          Kamika Verma    None
37562  38277  nm1029114    Dhorairaj Bhagavan    None
37563  38278  nm3769883          Nasir Shaikh    None
37564  38280  nm1470989                Kannan    None
37565  38281  nm0298158          Adrian Fulle    None

[37566 rows x 4 columns]

In [29]:

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))
'''*** Write your query that will have at least one male actor try to use query that you have written above ***'''

query_5ab ="""
WITH CTE1 AS(
SELECT DISTINCT MID,gender, COUNT(*) Counts from
                              (SELECT  mv1.MID, ps1.Gender, ps1.PID FROM Movie mv1
                               JOIN M_Cast mc1
                               ON mv1.MID = mc1.MID
                               JOIN Person ps1
                               ON (mc1.PID) = ps1.PID)           
                               GROUP BY MID, gender)
                               SELECT * from CTE1 WHERE gender='Male' and counts>=1
                               """

print(grader_5ab(query_5ab))


# using the above queries, you can write the answer to the given question

         MID gender  Counts
0  tt0021594   Male       5
1  tt0026274   Male       9
2  tt0027256   Male       8
3  tt0028217   Male       7
4  tt0031580   Male      27
5  tt0033616   Male      46
6  tt0036077   Male      11
7  tt0038491   Male       7
8  tt0039654   Male       6
9  tt0040067   Male      10
True

In [30]:
c.execute('''CREATE TEMP TABLE temp2 (MID CHAR, GENDER CHAR, COUNTS INT)''')

In [31]:
c.execute('''INSERT INTO temp2(MID, GENDER, COUNTS)
select distinct MID,gender, count(*) Count from
                              (select  mv1.MID, ps1.Gender, ps1.PID from Movie mv1
                               join M_Cast mc1
                               ON mv1.MID = mc1.MID
                               Join Person ps1
                               ON (mc1.PID) = ps1.PID)           
                               group by MID, gender ''')

In [32]:
q5b='''SELECT * FROM temp2'''
pd.read_sql_query(q5b,conn)

            MID  GENDER  COUNTS
0     tt0021594    None       1
1     tt0021594  Female       3
2     tt0021594    Male       5
3     tt0026274    None       2
4     tt0026274  Female      11
...         ...     ...     ...
8841  tt8932884  Female       1
8842  tt8932884    Male       2
8843  tt9007142    None       1
8844  tt9007142  Female       4
8845  tt9007142    Male       5

[8846 rows x 3 columns]

In [33]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))

query5a = """ SELECT SUBSTR(year,-4) YEAR, COUNT(MID) FROM MOVIE WHERE MID IN(
SELECT MID FROM (
SELECT MID, SUM(CASE WHEN gender='Male' THEN Counts END) AS Male,
SUM(CASE WHEN gender='Female' THEN Counts END) AS Female,
SUM(CASE WHEN Gender IS NULL THEN Counts END) AS Nulls
FROM(
SELECT DISTINCT MID,gender, COUNT(*) Counts FROM
                              (SELECT  mv1.MID, ps1.Gender, ps1.PID FROM Movie mv1
                               JOIN M_Cast mc1
                               ON mv1.MID = mc1.MID
                               JOIN Person ps1
                               ON (mc1.PID) = ps1.PID)           
                               GROUP BY MID, gender
) GROUP BY MID
) WHERE Male IS NULL
) GROUP BY year"""
grader_5a(query5a)

   YEAR  COUNT(MID)
0  1939           1
1  1999           1
2  2000           1
3  2018           1
Wall time: 800 ms

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [34]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """ SELECT fem.years, tot.Total_count, (CAST(fem.counts as real)/cast(tot.Total_count as real)*100) Percentage_Female FROM
(
SELECT SUBSTR(year,-4) AS years, COUNT(MID) as counts
 FROM MOVIE WHERE MID IN(
SELECT MID FROM (
SELECT MID, SUM(CASE WHEN gender='Male' THEN Counts END) AS Male,
SUM(CASE WHEN gender='Female' THEN Counts END) AS Female,
SUM(CASE WHEN Gender IS NULL THEN Counts END) AS Nulls
FROM(
SELECT DISTINCT MID,gender, COUNT(*) Counts FROM
                              (SELECT  mv1.MID, ps1.Gender, ps1.PID FROM Movie mv1
                               JOIN M_Cast mc1
                               ON mv1.MID = mc1.MID
                               JOIN Person ps1
                               ON (mc1.PID) = ps1.PID)           
                               GROUP BY MID, gender
) GROUP BY MID 
) WHERE Male is null
) GROUP BY year)fem JOIN
(SELECT YEAR,COUNT(MID) total_count FROM MOVIE GROUP BY YEAR) tot ON fem.years=tot.year

"""
grader_5b(query5b)

  years  total_count  Percentage_Female
0  1939            2          50.000000
1  1999           66           1.515152
2  2000           64           1.562500
3  2018          104           0.961538
Wall time: 904 ms

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [35]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """ SELECT m.title, size.cast_size FROM movie m JOIN
(SELECT DISTINCT MID AS movies, COUNT(DISTINCT PID) AS cast_size FROM M_Cast GROUP BY movies) size ON m.MID=size.movies ORDER BY 2 DESC
 """
grader_6(query6)

                        title  cast_size
0               Ocean's Eight        238
1                    Apaharan        233
2                        Gold        215
3             My Name Is Khan        213
4  Captain America: Civil War        191
5                    Geostorm        170
6                     Striker        165
7                        2012        154
8                      Pixels        144
9       Yamla Pagla Deewana 2        140
Wall time: 192 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D

In [36]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 2))
""" *** Write a query that computes number of movies in each year *** """
query7a = """  SELECT YEAR, COUNT(MID) as Count FROM Movie GROUP BY Year ORDER BY 1 """
grader_7a(query7a)

# using the above query, you can write the answer to the given question

   year  Count
0  1931      1
1  1936      3
2  1939      2
3  1941      1
4  1943      1
5  1946      2
6  1947      2
7  1948      3
8  1949      3
9  1950      2
Wall time: 16 ms

In [37]:
c.execute('''CREATE TEMP TABLE temp_table2(year INT, count INT)''')

In [38]:

c.execute('''INSERT INTO temp_table2(year, count)
SELECT YEAR, COUNT(MID) as Count FROM Movie GROUP BY Year ORDER BY 1''')

In [39]:
pd.read_sql_query('Select * from temp_table2',conn)

    year  count
0   1931      1
1   1936      3
2   1939      2
3   1941      1
4   1943      1
..   ...    ...
73  2014    126
74  2015    119
75  2016    129
76  2017    126
77  2018    104

[78 rows x 2 columns]

In [40]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    assert (q7b_results.shape == (713, 4))
 
'''Write a query that will do joining of the above table(7a) with itself such that you will 
join with only rows if the second tables year is <= current_year+9 and more than or equal current_year'''


query7b = """  SELECT m1.year AS year1,m1.count AS count1, m2.year AS year2,m2.count AS count2 FROM temp_table2 m1 , temp_table2 m2 WHERE ((m2.year<=m1.year+9) AND (m2.year>=m1.year))
"""
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 

# using the above query, you can write the answer to the given question

   year1  count1  year2  count2
0   1931       1   1931       1
1   1931       1   1936       3
2   1931       1   1939       2
3   1936       3   1936       3
4   1936       3   1939       2
5   1936       3   1941       1
6   1936       3   1943       1
7   1939       2   1939       2
8   1939       2   1941       1
9   1939       2   1943       1
Wall time: 16 ms

In [41]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))


query7 = """ WITH CTE1 AS(
SELECT m1.year AS year1,m1.count AS count1, m2.year AS year2,m2.count AS count2 FROM temp_table2 m1 , temp_table2 m2 WHERE ((m2.year<=m1.year+9) AND (m2.year>=m1.year))
)SELECT year1, SUM(count2) FROM CTE1 GROUP BY year1 ORDER BY 2 DESC LIMIT 1"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

   year1  SUM(count2)
0   2008         1203
Wall time: 7.99 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

In [42]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    assert (q8a_results.shape == (73408, 3))
'''Write a query that will results in number of movies actor-director worked together'''

query8a = """ SELECT COUNT(m.MID), d.PID Director, C.PID Actor FROM movie m JOIN M_Director d ON m.MID=d.MID JOIN M_Cast c on c.MID=m.MID GROUP BY director, actor ORDER BY 1 DESC
"""
grader_8a(query8a)

# using the above query, you can write the answer to the given question

   COUNT(m.MID)   Director      Actor
0            23  nm0223522  nm0456094
1            20  nm0223522  nm0007106
2            20  nm0223522  nm0434318
3            19  nm0080315  nm0318622
4            17  nm0223522  nm0332871
5            16  nm0698184  nm0712546
6            15  nm0698184  nm2147526
7            14  nm0080315  nm0451272
8            14  nm0223522  nm0442479
9            14  nm0223522  nm0451600
Wall time: 864 ms

In [43]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """SELECT y.Yash, y.Actor FROM(
SELECT COUNT(m.MID) AS Yash, d.PID Director, C.PID Actor FROM movie m JOIN M_Director d ON m.MID=d.MID JOIN M_Cast c ON c.MID=m.MID WHERE Director='nm0007181' GROUP BY director, actor 
) y LEFT JOIN(
SELECT DISTINCT ACTOR, max(COUNTS) OVER(PARTITION BY Actor) AS final_count  FROM(
SELECT COUNT(m.MID) AS Counts, d.PID Director, C.PID Actor FROM movie m JOIN M_Director d ON m.MID=d.MID JOIN M_Cast c ON c.MID=m.MID GROUP BY director, actor
) ORDER BY 2 desc) o ON y.Actor=o.Actor WHERE yash>final_count OR yash=final_count ORDER BY 1 DESC
"""
grader_8(query8)

   Yash      Actor
0    11  nm0707271
1    10  nm0471443
2     9  nm0407002
3     7  nm0004434
4     5  nm0347901
5     5  nm0716851
6     4  nm0433945
7     4  nm0755087
8     4  nm0802183
9     3  nm0158332
(245, 2)
Wall time: 1.67 s

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [44]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """ 
SELECT * FROM (
SELECT TRIM(PID)AS PID FROM M_Cast WHERE (MID) IN (
SELECT MID FROM M_Cast WHERE (PID) IN(
SELECT pid from m_cast where trim(MID) in(
SELECT MID FROM M_Cast WHERE trim(PID)='nm0451321')))
INTERSECT
SELECT TRIM(pid) AS PID from m_cast where trim(MID) in(
SELECT MID FROM M_Cast WHERE trim(PID)='nm0451321')) WHERE trim(PID)!='nm0451321'
"""
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

         PID
0  nm0000818
1  nm0000821
2  nm0001934
3  nm0002043
4  nm0004109
5  nm0004334
6  nm0004335
7  nm0004363
8  nm0004418
9  nm0004429
(2382, 1)
Wall time: 696 ms

In [45]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """ SELECT NAME FROM Person WHERE PID IN (
SELECT TRIM(PID) FROM M_Cast WHERE (MID) IN (
SELECT MID FROM M_Cast WHERE (PID) IN(
SELECT pid from m_cast WHERE trim(MID) in(
SELECT MID FROM M_Cast WHERE trim(PID)='nm0451321')))
EXCEPT
SELECT TRIM(pid) from m_cast WHERE trim(MID) in(
SELECT MID FROM M_Cast WHERE trim(PID)='nm0451321'))"""
grader_9(query9)

                    Name
0           Freida Pinto
1            Rohan Chand
2           Damian Young
3        Waris Ahluwalia
4  Caroline Christl Long
5          Rajeev Pahuja
6      Michelle Santiago
7        Alicia Vikander
8           Dominic West
9         Walton Goggins
(25698, 1)
Wall time: 680 ms